Revit 2024 API
CompoundStructure.SetMaterialId Method
 Sets a material element for a specified layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetMaterialId(
	int layerIdx,
	ElementId materialId
)
Visual Basic
Public Sub SetMaterialId ( _
	layerIdx As Integer, _
	materialId As ElementId _
)
Visual C++
public:
void SetMaterialId(
	int layerIdx,
	ElementId^ materialId
)
Parameters
layerIdx
Type: System.Int32
 Index of a layer in the CompoundStructure.
materialId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of a Material element.
Remarks
 It is not verified that materialId corresponds to a valid Material element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The layer index is out of range.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace